[
  {
    "id": "01",
    "rating": "4.5",
    "total_purchase": 1488,
    "name": "Learn HTML",
    "title": "HTML is a standard markup language for web page creation",
    "price": "$ 35",
    "thumbnail_url": "https://i.ibb.co/H4Pc90d/HTML-Thumb.png",
    "image_url": "https://i.ibb.co/DprYb7B/HTML-image.jpg",
    "details": "The so-called language for marking up hypertext, i.e. HTML (Hyper Text Markup Language) is primarily used when you need to create a specific web page with the use of different editors. And HTML editors, besides Adobe Cold Fusion, include FrontPage and Dreamweaver, Microsoft Visual Basic Developer and others. The current version is tagged as HTML 4.01, and the standardization is dealt by W3C, that is, the World Wide Web Consortium. In order to clearly understand the definition of this term, attention must first be given to defining the so-called hypertexts. Basically, it is a special type of content that, besides specific words, certainly contains an image or a video, or an audio track. And in this connection, it is good to note that HTML is actually a smaller set of SGML, which is the abbreviation of the Standard General Markup Language. Namely, this type of language is directly in charge of determining the appearance of all the pages that are found in various World Wide Web documents, and it is also applied in situations where it is necessary to establish a connection between documents. The common definition of the term HTML reads: HTML is a standardized language, which is used to define the structure of texts, media and embedded objects within web pages and e-mail. Often it can be heard that the HTML characters, that is, the so-called tags, are also called codes, but it is usually wrong use of this word. The reason for this is in the fact that the definition of a computer code is quite different, and that HTML tags should mark the structure of a particular content, with the aim that the Internet browser, that is, the User Agent can first recognize the specific structure, and immediately after display it in the predicted way and in the predefined place, that is exactly in that window of the web browser that is currently used. In addition to HTML, CSS (Cascading Style Sheets) is also used, as well as numerous scripting languages, such as for example JavaScript or VBScript, and DOM (Document Object Model). The purpose of applying all of these, but also many other additions, is to improve a particular website, that is, to make its modification in order to be as good as possible. Similarly, in addition to HTML, PHP (Hypertext Preprocessor) and ASP (Active Server Pages) are also used, so that communication between a particular site and browser can be as good and faster as possible. The basic application of this language is found in the situation when it is necessary to separate specific elements on one page, so using HTML tags it can be precisely defined where the title should be located, for example, but also all the other items that this page contains. And within the standards that the mentioned language uses there are already implemented elements whose primary purpose is to describe the characteristics of a particular page, such as keywords or description of content, that is information about the author and other. All this information applies to the so-called metadata and is definitely very precisely separated from the content of the page itself, i.e. the HTML document. The creation of a specific HTML document definitely starts from defining its type, that is, from determining the DTD (Document Type Definition) which is determined on the basis of the standard used on this occasion for its creation. As for the HTML tags, they are primarily used to make it clear to the browser in what way specific content should be visible. Usually, these tags are placed at the very beginning and at the end of a specific document and are displayed between these two symbols < >. And between these two tags, of course, there is both the content of a particular page, that is, the document, and all the other tags it contains. The characteristic of these tags is that they do not differentiate between upper and lower case, that is, they are not sensitive to them, as is the case with, let's say, the URL. The header tag is the so-called tag head, and that part will certainly not be displayed to the user on the screen but is primarily used to precisely define the properties of a particular document. When determining what the size of the letters in a specific case, the so-called header tag is used, and font size is determined based on 6 available levels, i.e. from h1 to h6."
  },
  {
    "id": "02",
    "rating": "4.8",
    "total_purchase": 1466,
    "name": "Learn CSS",
    "title": "CSS is a stylesheet language used to describe the presentation of a document written in HTML",
    "price": "$ 33",
    "thumbnail_url": "https://elvisherlan.files.wordpress.com/2020/11/css.jpg",
    "image_url": "https://www.oxfordwebstudio.com/user/pages/06.da-li-znate/sta-je-css/sta-je-css.png",
    "details": "CSS (Cascading Style Sheets) is the language used to describe the layout of websites. Although it is most commonly used in the development of web pages and user interfaces of online applications, any type of XML document can use CSS. In the beginning, this role was taken over by the very HTML. As sites have become increasingly complex, the code became highly unreadable and complicated for maintenance. Then it became clear that some new method must be introduced to solve this problem. The solution came in the mid-1990s in the form of CSS, then called CHSS. There are several versions of CSS. Each of them was upgraded to the previous one and provided new opportunities. So far, versions CSS1, CSS2, CSS3, and CSS4 have been released. Version CSS4 does not exist on its own, but there are a number of modules of the fourth level, so it is mentioned when speaking about CSS versions. The CSS code is in most cases found in a separate document that is then included where necessary. This is also the best method of working with CSS. It is also possible to use CSS directly in a document whose design is changed. This can be done in the header of the document, or in the tag of the element whose appearance is affected. Although the benefits of using CSS are not questionable, it also has a few limitations. Different Internet browsers interpret the code in different ways so it is necessary to use different methods to obtain consistency of appearance."
  },
  {
    "id": "03",
    "rating": "4.6",
    "total_purchase": 1449,
    "name": "Learn JavaScript",
    "title": "JavaScript is the world's most popular programming language of the Web.",
    "price": "$ 32",
    "thumbnail_url": "https://www.kaarinfotech.com/assets/img/language/JavaScript-Logo.jpg",
    "image_url": "https://www.oxfordwebstudio.com/user/pages/06.da-li-znate/sta-je-javascript/sta-je-javascript.jpg",
    "details": "The fact is that many who are not informed sufficiently tend to state that Java and Javascript are fully identical programming languages, so we will definitely specify on this occasion what exactly is meant by the JavaScript. This is the so-called object scripting language, whose main purpose of use is to improve the dynamics of a particular page. In fact, the thing is that when using HTML code, its role is only to shape certain page elements, such as text, tables, links or forms, and then edit them, but this code does not have the role of determining the way in which specific elements will behave. It is then that the entire process involves JavaScript, which plays a significant role in creating the behavior of these elements. And when combined with HTML and CSS, then the so-called dynamic HTML (DHTML) is created. When it is said that a scripting language is object, it actually means that the person who works with it should specify the type of data, but also to define which exact function will be applied, which must be specified on the basis of the structure of the specific data. Such a principle leads to the fact that the structure of certain data actually begins to be treated as an object within which these data and certain functions are located. The use of this programming language also determines the relationships between the two objects. This scripting language is composed of numerous commands, which must be read in the special program called Interpreter. It serves to read these commands, without translating them at the same time into the so-called machine language. More precisely, then the commands are read directly from the code, and therefore we say that the JavaScript programming language is executed on the Client side, that is, on the user's side. Simply put, the thing is that all of this is done on the computer where a user starts the content with this programming language - here is a clearly discernible difference in relation to HTML, which works so that the user sends certain data for processing to a specific server, but requires them to be fully valid. JavaScript actually performs all the necessary data checks in a specific browser and thus contributes to a better functioning of the whole process. It is considered that one of the most popular scripting languages used today is JavaScript, and it is especially good that it is supported by all the browsers with the most common application (Mozilla Firefox, Opera, Internet Explorer, etc.). After World Wide Web was officially created, Netscape actually created the first scripting language whose primary goal was to increase the dynamics of specific websites or their interactivity. And this was the so-called Mocha scripting language, which was later called LiveScript, only to finally start functioning under the present name. However, there was a big confusion because people thought that Java was the same as JavaScript. Today, it is considered that this company has used this name exclusively for marketing purposes, but Microsoft still used the moment and placed the so-called VBScript scripting language, and in that period the so-called JScript was integrated into the current Internet Explorer 3.0. In order to resolve all these disputes, the company that created JavaScript sent to European Organization for Standardization JavaScript ECMA (European Computer Manufacturers Association), and since then, the standardized version of this language is called ECMAScript, provided that this term is not used at all. It is known that JAvaScript was created by Brendon Eich, and the most important elements of this programming language are, practically speaking, taken over from the Self-programming language, but of course, everything has been improved. So it is almost unthinkable that any web application works just without it. There is almost no similarity between Java and JavaScript, except for nuances, and they are first seen in syntax, since both programming languages somewhat follow the rules of language C. However, there are very noticeable differences between these two scripting languages, and are primarily reflected in the fact that Java is characterized as an object-oriented language, while JavaScript is purely object. And there is also the difference that Java requires pre-defining of types of variables, while this is not the case with JavaScript."
  },
  {
    "id": "04",
    "rating": "4.5",
    "total_purchase": 1430,
    "name": "Learn React",
    "title": "React. A JavaScript library for building user interfaces",
    "price": "$ 30",
    "thumbnail_url": "https://www.nicepng.com/png/detail/222-2224705_react-js-logo.png",
    "image_url": "https://mechomotive.com/wp-content/uploads/2021/08/react.jpg",
    "details": "React.js was released by a software engineer working for Facebook – Jordane Walke in 2011. React is a JavaScript library focused on creating declarative user interfaces (UIs) using a component-based concept. It’s used for handling the view layer and can be used for web and mobile apps. React’s main goal is to be extensive, fast,  declarative, flexible, and simple. React is not a framework, it is specifically a library.  The explanation for this is that React only deals with rendering UIs and reserves many things at the discretion of individual projects. The standard set of tools for creating an application using ReactJS is frequently called the stack. Why use React? Let’s take a more detailed look at what sets React library aside against other frameworks and libraries and makes it so powerful and popular for application development. "
  },
  {
    "id": "05",
    "rating": "4.6",
    "total_purchase": 1425,
    "name": "Learn Bootstrap",
    "title": "Build fast, responsive sites with Bootstrap",
    "price": "$ 25",
    "thumbnail_url": "https://pbs.twimg.com/profile_images/1273081551354396672/-Tzadxix_400x400.jpg",
    "image_url": "https://www.creativewavetech.com/assets/img/boostrap.png",
    "details": "Bootstrap is a free, open source front-end development framework for the creation of websites and web apps. Designed to enable responsive development of mobile-first websites, Bootstrap provides a collection of syntax for template designs. As a framework, Bootstrap includes the basics for responsive web development, so developers only need to insert the code into a pre-defined grid system. The Bootstrap framework is built on Hypertext Markup Language (HTML), cascading style sheets (CSS) and JavaScript. Web developers using Bootstrap can build websites much faster without spending time worrying about basic commands and functions. Bootstrap makes responsive web design a reality. It makes it possible for a web page or app to detect the visitor's screen size and orientation and automatically adapt the display accordingly. The mobile-first approach assumes smartphones, tablets and task-specific mobile apps are employees' primary tools for getting work done. Bootstrap addresses the requirements of those technologies in design and includes UI components, layouts, JavaScript tools and the implementation framework. The software is available precompiled or as source code. Mark Otto and Jacob Thornton developed Bootstrap at Twitter to improve the consistency of tools used on the site and to reduce maintenance. The software was formerly known as Twitter Blueprint and is sometimes referred to as Twitter Bootstrap."
  },
  {
    "id": "06",
    "rating": "4.5",
    "total_purchase": 1437,
    "name": "Learn Tailwind CSS",
    "title": "Rapidly build modern websites without ever leaving your HTML",
    "price": "$ 20",
    "thumbnail_url": "https://miro.medium.com/max/450/1*9V4r2JpA02Jzu0Tro-i6hg.png",
    "image_url": "https://tailwindcss.com/_next/static/media/tailwindui-small@75.8bb955b2.jpg",
    "details": "Writing CSS can be really difficult. Period. And I get it – it can be frustrating to nail down your own ideas or the designs you get from your design team. I'm sure many of you have gone through the same pain at least a few times in your development careers. Well not anymore. Because it's time to learn an interesting tool that takes away a lot of the burden from us. And no it's not Bootstrap – it's called Tailwind CSS. While Tailwind has been around for a while now, you may not have come across it yet. Perhaps you just haven't heard about it, or you don't really know whether learning a new piece of tech related to CSS will really make your life easier. And indeed there are a lot of ways to write CSS out there – like Vanilla CSS3, LESS, SCSS, Bootstrap, styled-components, Windi CSS, and more...phew. Quite a list isn't it? I hope this short guide will help you understand Tailwind CSS and its benefits so that you can say. This is it. This is the one. Well enough of the chit chat. Let's dive straight in."
  }
]